{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Cypher: Cómo definir un esquema\n",
    "\n",
    "En este notebook vamos a ver como crear un esquema en Neo4j, para ello vamos a ver como:\n",
    "\n",
    "* Definir y utilizar índices\n",
    "* Definir y utilizar costraints\n",
    "\n",
    "Como en los notebooks anteriores primero vamos a importar las librerías y a borrar todos los nodos y realciones que hay en la base de datos."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext cypher\n",
    "%matplotlib inline"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6 nodes deleted.\n",
      "3 relationship deleted.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "MATCH (n) DETACH DELETE n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ahora vamos a crear el grafo que vamos a utilizar como base para el ejercicio:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6 nodes created.\n",
      "13 properties set.\n",
      "3 relationships created.\n",
      "6 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "CREATE (matrix:Movie { title:\"The Matrix\",released:1997 })\n",
    "CREATE (cloudAtlas:Movie { title:\"Cloud Atlas\",released:2012 })\n",
    "CREATE (forrestGump:Movie { title:\"Forrest Gump\",released:1994 })\n",
    "CREATE (keanu:Actor { name:\"Keanu Reeves\"})\n",
    "CREATE (robert:Actor { name:\"Robert Zemeckis\", born:1951 })\n",
    "CREATE (tom:Actor { name:\"Tom Hanks\", born:1956 })\n",
    "CREATE (tom)-[:ACTED_IN { roles: [\"Forrest\"]}]->(forrestGump)\n",
    "CREATE (tom)-[:ACTED_IN { roles: ['Zachry']}]->(cloudAtlas)\n",
    "CREATE (robert)-[:DIRECTED]->(forrestGump)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Como resultado obtenemos el siguiente grafo:\n",
    "\n",
    "<img src=\"../images/neo4j/cypher31.png\" alt=\"Initial Graph\"/>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Índices\n",
    "\n",
    "La razón principal para crear un índice es la de encontrar el nodo inical de una búsqueda por recorrido del grafo.\n",
    "Un índice se puede crear en cualquier momento, aunque si el grafo tiene datos puede que el índice tarde un tiempo en estar disponible.\n",
    "\n",
    "En este caso queremos hacer un índice para encontrar de forma más rápida los actores por nombre.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 indexes added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "CREATE INDEX ON :Actor(name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "El ínide creado se utilizará de forma automática en la siguiente sentencia."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>actor</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Tom Hanks&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'born': 1956, 'name': 'Tom Hanks'}]]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "MATCH (actor:Actor { name: \"Tom Hanks\" })\n",
    "RETURN actor;"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "También se pueden crear índices sobre varios sobre varias propiedades de un nodo con una determinada etiqueta. \n",
    "Por ejemplo, podemos crear un índice compuesto sobre las propiedades *name* y *born* de los nodos etiquetados como *:Person*. \n",
    "\n",
    "Nota: los nodos de tipo *:Person* que sólo tienen el atributo *name* y no tienen el atributo *born* no se indexarían, por lo qe en nodo *'Keanu Reves'* no se indexaria. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 indexes added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "CREATE INDEX ON :Actor(name, born)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Para saber que índices hay creados en la base de datos podemos utilizar el procedimiemto **db.indexes**.\n",
    "\n",
    "Para hacer la llamada a un procedimiento utilizamos la cláusula **CALL**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>description</th>\n",
       "        <th>tokenNames</th>\n",
       "        <th>properties</th>\n",
       "        <th>type</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>INDEX ON :Actor(name)</td>\n",
       "        <td>[&#x27;Actor&#x27;]</td>\n",
       "        <td>[&#x27;name&#x27;]</td>\n",
       "        <td>node_label_property</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>INDEX ON :Actor(name, born)</td>\n",
       "        <td>[&#x27;Actor&#x27;]</td>\n",
       "        <td>[&#x27;name&#x27;, &#x27;born&#x27;]</td>\n",
       "        <td>node_label_property</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['INDEX ON :Actor(name)', ['Actor'], ['name'], 'node_label_property'],\n",
       " ['INDEX ON :Actor(name, born)',\n",
       "  ['Actor'],\n",
       "  ['name', 'born'],\n",
       "  'node_label_property']]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "CALL db.indexes\n",
    "YIELD description, tokenNames, properties, type;"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Para borrar un índice se utiliza la sentencia **DROP INDEX**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 indexes removed.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "DROP INDEX ON :Actor(name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Para saber más sobre índices puedes visitar la página asociada en la documentación de Neo4j: https://neo4j.com/docs/cypher-manual/current/administration/indexes-for-search-performance/"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Constraints\n",
    "\n",
    "Los constraints o reestricciones se utilizan para asegurarnos de que los datos que se insertan cumplen las reglas del dominio que se está modelando. Por ejemplo que para los nodos con la etiqueta *:Actor* la propiedad *name* sea única entre todos ellos.\n",
    "\n",
    "En nuestro caso si queremos que los nodos etiquedados como *:Pelicula* nuncan contengan mas de un nodo con la propiedad *title* repetida podemos utilizar especificar la constraint **IS UNIQUE** "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 constraints added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "CREATE CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Implicitamente al crear la constraint se está creando un índice para esa propiedad. Si la constraint se elimina, el índice también se elimina y habría que crearlo si queremos seguir utilizándolo.\n",
    "\n",
    "Para saber cuantas constraints hay creadas en nuestra base de datos podemos utillizar el procedimiento **db.constraints**."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>description</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>CONSTRAINT ON ( movie:Movie ) ASSERT movie.title IS UNIQUE</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['CONSTRAINT ON ( movie:Movie ) ASSERT movie.title IS UNIQUE']]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "CALL db.constraints"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Para borrar una constraint utilizamos la clausula **DROP CONSTRAINT**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 constraints removed.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "DROP CONSTRAINT ON (movie:Movie) ASSERT movie.title IS UNIQUE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Para saber más sobre las constraints puedes consultar la página relaccionada en la documentación de Neo4j:\n",
    "https://neo4j.com/docs/cypher-manual/current/administration/constraints/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
