{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Social Recomendations\n",
    "\n",
    "En este notebook vamos a estudiar un caso de uso real de una base de datos de grafos para entender el potencial que nod puede proveer en casos reales.\n",
    "\n",
    "## Talent.net\n",
    "Talent.net es una aplicación de recomendaciones que permite a los usuarios descubrir su propia red profesional e identificar a otros usuarios y su conjunto de habilidades particulares. \n",
    "\n",
    "Los usuarios trabajan en empresas y en proyectos y tienen uno o más intereses o habilidades. \n",
    "\n",
    "Con esta información, Talent.net puede describir la red profesional de un usuario identificando otros suscriptores que comparten sus intereses. \n",
    "\n",
    "Las búsquedas se pueden restringir a la compañía en la que trabaja actualmente del usuario, o extenderala para abarcar toda la base de suscriptores. \n",
    "\n",
    "Talent.net también puede identificar individuos con habilidades específicas que están directa o indirectamente\n",
    "conectados al usuario actual. \n",
    "\n",
    "Dichas búsquedas son útiles cuando se busca a un experto en la una materia para un compromiso laboral.\n",
    "\n",
    "Para entender mejor el modelo de datos de talent.net podemos consultar la siguiente imagen.\n",
    "\n",
    "<img src=\"../images/neo4j/talent1.png\" alt=\"Initial Graph\"/>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "El gráfico de muestra sólo tiene dos compañías, cada una con varios empleados. Un empleado está conectado a la empresa en la que trabaja por una relación WORKS_FOR. Cada empleado está interesado (INTERESTED_IN) en uno o más temas y ha trabajado (TRABAJADO_ON) en uno o más proyectos. Ocasionalmente, los empleados de diferentes compañías pueden trabajar en el mismo proyecto.\n",
    "\n",
    "Con este grafo podemos modelar dos casos de uso:\n",
    "\n",
    "* Dado un usuario inferir sus relaciones sociales, esto es identificar su red social profesional basada en interes y habilidades comunes.\n",
    "* Recomendar trabajadores con los que ha trabajado o que han trabajado con alguien con el que ha trabajado con una competencia concreta.\n",
    "\n",
    "El primer caso de uso ayuda a construir comunidades entorno a intereses comunes y el segundo caso de uso ayuda a identificar personas para roles concretos en un trabajo.\n",
    "\n",
    "Para empezar con el ejemplo, vamos a importar las librerías, borrar la base de datos existente y crear el grafo de ejemplo de la imagen anterior."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext cypher\n",
    "%matplotlib inline"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "17 nodes deleted.\n",
      "21 relationship deleted.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "MATCH (n) DETACH DELETE n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "CREATE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 1. Inferir relaciones sociales"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>name</th>\n",
       "        <th>score</th>\n",
       "        <th>interests</th>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "MATCH (subject:User {name:'Sarah'})\n",
    "MATCH (subject)-[:WORKS_FOR]->(company:Company)<-[:WORKS_FOR]-(person:User),\n",
    "      (subject)-[:INTERESTED_IN]->(interest)<-[:INTERESTED_IN]-(person:User)\n",
    "RETURN person.name AS name,\n",
    "       count(interest) AS score,\n",
    "       collect(interest.name) AS interests\n",
    "ORDER BY score DESC"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "El subgrafo que cumple el patrón anterior es el siguiente:\n",
    "\n",
    "<img src=\"../images/neo4j/talent3.png\" alt=\"Initial Graph\"/>\n",
    "\n",
    "La sentencia anterior sólo búsca personas que trabajan en la misma compañía que Sarah, si queremos extender la búsqueda para encontrar personas de otras compañías tendríamos que cambiar la consulta. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>name</th>\n",
       "        <th>company</th>\n",
       "        <th>score</th>\n",
       "        <th>interests</th>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "MATCH (subject:User {name:'Sarah'})\n",
    "MATCH (subject)-[:INTERESTED_IN]->(interest:Topic)<-[:INTERESTED_IN]-(person:User),\n",
    "      (person)-[:WORKS_FOR]->(company:Company)\n",
    "RETURN person.name AS name,\n",
    "       company.name AS company,\n",
    "       count(interest) AS score,\n",
    "       collect(interest.name) AS interests\n",
    "ORDER BY score DESC"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "El subgrafo que cumple el patrón anterior es el siguiente:\n",
    "\n",
    "<img src=\"../images/neo4j/talent4.png\" alt=\"Initial Graph\"/>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2. Buscar compañeros con intereses particulares\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>name</th>\n",
       "        <th>score</th>\n",
       "        <th>interests</th>\n",
       "        <th>distance</th>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:1234@127.0.0.1:7474/db/data\n",
    "MATCH (subject:User {name:'Sarah'})\n",
    "MATCH p=(subject)-[:WORKED_ON]->(:Project)-[:WORKED_ON*0..2]-(:Project)<-[:WORKED_ON]-(person:User)-[:INTERESTED_IN]->(interest:Topic)\n",
    "WHERE person<>subject AND interest.name IN ['Java', 'Travel', 'Medicine']\n",
    "WITH person, interest, min(length(p)) as pathLength\n",
    "ORDER BY interest.name\n",
    "RETURN person.name AS name,\n",
    "       count(interest) AS score,\n",
    "       collect(interest.name) AS interests,\n",
    "       ((pathLength - 1)/2) AS distance\n",
    "ORDER BY score DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "El subgrafo que cumple el patrón anterior es el siguiente:\n",
    "\n",
    "<img src=\"../images/neo4j/talent5.png\" alt=\"Initial Graph\"/>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"../images/neo4j/talent6.png\" alt=\"Initial Graph\"/>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
